fanmuzhi/STM32_ARM/Src/main.c
	}
	ledTimer->last_led_tim_val = 0;
	ledTimer->tim_isStarted = 0;
	return 0;
}

/**
  * @brief EXTI line detection callbacks
  * @param GPIO_Pin: Specifies the pins connected EXTI line
  * @retval None
  */
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  if(GPIO_Pin == GPIO_PIN_1)
  {
    /* Switch LED White */
		if(led_W.tim_isStarted != 0)
		{
			vTurnOffLed(&led_W);
		}
    else
		{
			vTurnOnLed(&led_W, 0x0fff);
		}
//		CDC_Transmit_FS( UserTxBuffer,  sizeof(UserTxBuffer) );
  }  
	else if(GPIO_Pin == GPIO_PIN_9)
  {
    /* Switch LED IR */
		if(led_IR.tim_isStarted != 0)
		{
			vTurnOffLed(&led_IR);
		}
    else
		{
			vTurnOnLed(&led_IR, 0x0fff);
		}
//		CDC_Transmit_FS( UserTxBuffer,  sizeof(UserTxBuffer) );
  }
	return;
}

// poweron SPIVCC with the voltage defined in head file macro
// Return value: 0 is success, 2 is failure
int iEnableSPIVCC( int iVoltage )
{
	 int count;
	 
	 HAL_GPIO_WritePin( GPIOC, SPIVCC_200mV_Pin,  iVoltage & SPIVCC_200mV_Pin  ? GPIO_PIN_SET : GPIO_PIN_RESET );      // set low to enable 200mV
	 HAL_GPIO_WritePin( GPIOC, SPIVCC_100mV_Pin,  iVoltage & SPIVCC_100mV_Pin  ? GPIO_PIN_SET : GPIO_PIN_RESET );      // set low to enable 100mV
	 HAL_GPIO_WritePin( GPIOC, SPIVCC_50mV_Pin,   iVoltage & SPIVCC_50mV_Pin   ? GPIO_PIN_SET : GPIO_PIN_RESET );      // set low to enable 50mV
	 HAL_GPIO_WritePin( GPIOC, SPIVCC_800mV_Pin,  iVoltage & SPIVCC_800mV_Pin  ? GPIO_PIN_SET : GPIO_PIN_RESET );      // set low to enable 800mV
	 HAL_GPIO_WritePin( GPIOC, SPIVCC_400mV_Pin,  iVoltage & SPIVCC_400mV_Pin  ? GPIO_PIN_SET : GPIO_PIN_RESET );      // set low to enable 400mV
	 HAL_GPIO_WritePin( GPIOC, SPIVCC_1600mV_Pin, iVoltage & SPIVCC_1600mV_Pin ? GPIO_PIN_SET : GPIO_PIN_RESET ); // set low to enable 1600mV
				 
	 HAL_GPIO_WritePin( GPIOI, SPIVCC_EN_Pin, GPIO_PIN_SET);            // enable SPIVCC
	 
	 count = 5000; // 2266 actual
	 while( ( HAL_GPIO_ReadPin( SPIVCC_PG_GPIO_Port, SPIVCC_PG_Pin ) != GPIO_PIN_SET ) && ( count != 0 ) )      // PG is set?
	 {
				 count--;
	 }
	 
	 if( count )
	 {
				 return 0;
	 }
	 else
	 {
				 return 2;
	 }
}

// poweron module VCC with the voltage defined in head file macro
// Return value: 0 is success, 1 is parameter out of range, 2 is failure
int iEnableSENSORVCC( int iVoltage )
{
	 int count;
	 
	 if( iVoltage > SENSOR_VCC_0V90 || iVoltage < SENSOR_VCC_3V50 )     // out of range
	 {
				 return 1;
	 }
	 
	 HAL_GPIO_WritePin( GPIOE, VCC_200mV_Pin,  iVoltage & VCC_200mV_Pin  ? GPIO_PIN_SET : GPIO_PIN_RESET ); // set low to enable 200mV
	 HAL_GPIO_WritePin( GPIOE, VCC_100mV_Pin,  iVoltage & VCC_100mV_Pin  ? GPIO_PIN_SET : GPIO_PIN_RESET ); // set low to enable 100mV
	 HAL_GPIO_WritePin( GPIOE, VCC_50mV_Pin,   iVoltage & VCC_50mV_Pin   ? GPIO_PIN_SET : GPIO_PIN_RESET ); // set low to enable 50mV
	 HAL_GPIO_WritePin( GPIOE, VCC_800mV_Pin,  iVoltage & VCC_800mV_Pin  ? GPIO_PIN_SET : GPIO_PIN_RESET ); // set low to enable 800mV
	 HAL_GPIO_WritePin( GPIOE, VCC_400mV_Pin,  iVoltage & VCC_400mV_Pin  ? GPIO_PIN_SET : GPIO_PIN_RESET ); // set low to enable 400mV
	 HAL_GPIO_WritePin( GPIOE, VCC_1600mV_Pin, iVoltage & VCC_1600mV_Pin ? GPIO_PIN_SET : GPIO_PIN_RESET ); // set low to enable 1600mV
				 
	 HAL_GPIO_WritePin( GPIOI, VCC_EN_Pin, GPIO_PIN_SET);        // enable module VCC
	 
	 count = 5000; // 2266 actual
	 while( HAL_GPIO_ReadPin( VCC_PG_GPIO_Port, VCC_PG_Pin ) != GPIO_PIN_SET && count != 0 )     // PG is set?
	 {
				 count--;
	 }
	 
	 if( count )
	 {
				 return 0;
	 }
	 else
	 {
				 return 2;
	 }
}



//Sensor_Status_t oSensorStatus;
uint32_t FpModule_getStatus(Sensor_Status_t *oSensorStatus)
{
//		deassertmcs();
    uint32_t status = 0;
		ep0status_t ep0val;
		uint32_t ep0size = EP0SIZE_BIG;
	
    //read from EP0IN 0x61
    //data length to read
		
    uint8_t  cmdbuf[2] = { EPSELBYTE_INTEGRIFY(EPSELBYTE_EP0IN), 0/* dummy byte */ };
		assertmcs();
//		status = HAL_SPI_TransmitReceive(&hspi5, &(cmdbuf[0]), (uint8_t *)&ep0val, ep0size, 2000);
		status = HAL_SPI_Transmit(&hspi5, cmdbuf, sizeof(cmdbuf), 2000);

//		if (HAL_SPI_Receive(&hspi5, (uint8_t *)&ep0val, ep0size, 2000) != HAL_OK)
//	  {
//	    return 1;
//	  }
		deassertmcs();
    if (0 == status)
    {
        //parse
        oSensorStatus->SOFTSTATE = EXTRACT32(ep0val, EP0IN_SOFTSTATE, EP0IN_SOFTSTATE_B);
        oSensorStatus->SOFTSTATE_EPSTATE = EXTRACT32(ep0val, EP0IN_SOFTSTATE_EP1STATE, EP0IN_SOFTSTATE_EP1STATE_B);
        oSensorStatus->SOFTSTATE_FPSTATE = EXTRACT32(ep0val, EP0IN_SOFTSTATE_FPSTATE, EP0IN_SOFTSTATE_FPSTATE_B);
        oSensorStatus->SOFTSTATE_SSLSTATE = EXTRACT32(ep0val, EP0IN_SOFTSTATE_SSLSTATE, EP0IN_SOFTSTATE_SSLSTATE_B);
        oSensorStatus->EP2FLUSH = EXTRACT32(ep0val, EP0IN_EP2FLUSH, EP0IN_EP2FLUSH_B);
        oSensorStatus->JUSTWOKE = EXTRACT32(ep0val, EP0IN_JUSTWOKE, EP0IN_JUSTWOKE_B);
        oSensorStatus->STATECHANGED = EXTRACT32(ep0val, EP0IN_STATECHANGED, EP0IN_STATECHANGED_B);
        oSensorStatus->EP2INSIZE = EXTRACT32(ep0val, EP0IN_EP2INSIZE, EP0IN_EP2INSIZE_B);
        oSensorStatus->EP2INDONE = EXTRACT32(ep0val, EP0IN_EP2INDONE, EP0IN_EP2INDONE_B);
        oSensorStatus->RUNNING = EXTRACT32(ep0val, EP0IN_RUNNING, EP0IN_RUNNING_B);
        oSensorStatus->EP1OUT = EXTRACT32(ep0val, EP0IN_EP1OUT, EP0IN_EP1OUT_B);
        oSensorStatus->EP1IN = EXTRACT32(ep0val, EP0IN_EP1IN, EP0IN_EP1IN_B);
        oSensorStatus->DRDY = EXTRACT32(ep0val, EP0IN_DRDY, EP0IN_DRDY_B);
        oSensorStatus->JUSTRESET = EXTRACT32(ep0val, EP0IN_JUSTRESET, EP0IN_JUSTRESET_B);
        oSensorStatus->ALIVE = EXTRACT32(ep0val, EP0IN_ALIVE, EP0IN_ALIVE_B);
        oSensorStatus->EP1INSIZE = EXTRACT32(ep0val, EP0IN_EP1INSIZE, EP0IN_EP1INSIZE_B);
        oSensorStatus->SOFTSTATE2 = EXTRACT32(ep0val, EP0IN_SOFTSTATE2, EP0IN_SOFTSTATE2_B);
    }

    return status;
}

//uint32_t crc32_calc(const uint8_t *datap, unsigned int nbytes, uint32_t crc)
//{
//#if 1
//    while (nbytes != 0) {
//        crc = crc32_table[((*datap++ << 24) ^ crc) >> 24] ^ (crc << 8);
//        nbytes--;
//    }

//    return ~crc;
//#else
//#define CRC32_POLY  0x04c11db7
//    unsigned int        bitnum, highbit;
//    uint8_t             val;

//    while (nbytes != 0) {
//        val = *datap++;
//        bitnum = 8;
//        while (bitnum != 0) {
//            highbit = (crc & 0x80000000) >> 31;
//            crc <<= 1;
//            if ((highbit ^ ((val >> 7) & 1)) == 1) {
//                crc ^= CRC32_POLY;
//            }
//            val <<= 1;

//            bitnum--;
//        }

//        nbytes--;
//    }


//    return ~crc;
//#endif

//}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
